ChibiOS/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.h
#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_HSI16
  #define STM32_LPTIM2CLK           STM32_HSI16CLK

#elif STM32_LPTIM2SEL == STM32_LPTIM2SEL_LSE
  #define STM32_LPTIM2CLK           STM32_LSECLK

#else
#error "invalid source selected for LPTIM2 clock"
#endif

/**
 * @brief   RNGDIV field.
 */
#if (STM32_RNGDIV_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_RNGDIV              (0U << 28U)

#elif STM32_RNGDIV_VALUE == 2
  #define STM32_RNGDIV              (1U << 28U)

#elif STM32_RNGDIV_VALUE == 4
  #define STM32_RNGDIV              (2U << 28U)

#elif STM32_RNGDIV_VALUE == 8
  #define STM32_RNGDIV              (3U << 28U)

#else
  #error "invalid STM32_RNGDIV_VALUE value specified"
#endif

/**
 * @brief   RNG clock frequency.
 */
#if (STM32_RNGSEL == STM32_RNGSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RNGCLK              0

#elif STM32_RNGSEL == STM32_RNGSEL_HSI16
  #define STM32_RNGCLK              (STM32_HSI16CLK / STM32_RNGDIV_VALUE)

#elif STM32_RNGSEL == STM32_RNGSEL_SYSCLK
  #define STM32_RNGCLK              (STM32_SYSCLK / STM32_RNGDIV_VALUE)

#elif STM32_RNGSEL == STM32_RNGSEL_PLLQCLK
  #define STM32_RNGCLK              (STM32_PLL_Q_CLKOUT / STM32_RNGDIV_VALUE)


#else
#error "invalid source selected for RNG clock"
#endif

/**
 * @brief   ADC clock frequency.
 */
#if (STM32_ADCSEL == STM32_ADCSEL_SYSCLK) || defined(__DOXYGEN__)
  #define STM32_ADCCLK              STM32_SYSCLK

#elif STM32_ADCSEL == STM32_ADCSEL_PLLPCLK
  #define STM32_ADCCLK              STM32_PLL_P_CLKOUT

#elif STM32_ADCSEL == STM32_ADCSEL_HSI16
  #define STM32_ADCCLK              STM32_HSI16CLK

#else
  #error "invalid source selected for ADC clock"
#endif

/**
 * @brief   TIMPCLK clock frequency.
 */
#if (STM32_PPRE == STM32_PPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_TIMPCLK             (STM32_PCLK * 1)

#else
  #define STM32_TIMPCLK             (STM32_PCLK * 2)
#endif

/**
 * @brief   TIM1 clock frequency.
 */
#if (STM32_TIM1SEL == STM32_TIM1SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM1CLK             STM32_TIMPCLK

#elif STM32_TIM1SEL == STM32_TIM1SEL_PLLQCLK
  #define STM32_TIM1CLK             STM32_PLL_Q_CLKOUT

#else
  #error "invalid source selected for TIM1 clock"
#endif

/**
 * @brief   TIM15 clock frequency.
 */
#if (STM32_TIM15SEL == STM32_TIM15SEL_TIMPCLK) || defined(__DOXYGEN__)
  #define STM32_TIM15CLK            STM32_TIMPCLK

#elif STM32_TIM15SEL == STM32_TIM15SEL_PLLQCLK
  #define STM32_TIM15CLK            STM32_PLL_Q_CLKOUT

#else
#error "invalid source selected for TIM15 clock"
#endif

/**
 * @brief   Clock of timers connected to APB1.
 */
#define STM32_TIMCLK1               STM32_TIMPCLK

/**
 * @brief   Clock of timers connected to APB2.
 */
#define STM32_TIMCLK2               STM32_TIMPCLK

/**
 * @brief   Flash settings.
 */
#if (STM32_HCLK <= STM32_0WS_THRESHOLD) || defined(__DOXYGEN__)
  #define STM32_FLASHBITS           0

#elif STM32_HCLK <= STM32_1WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_0

#elif STM32_HCLK <= STM32_2WS_THRESHOLD
  #define STM32_FLASHBITS           FLASH_ACR_LATENCY_1

#else
  #define STM32_FLASHBITS           (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0)
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "stm32_isr.h"
#include "stm32_dma.h"
#include "stm32_exti.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void stm32_clock_init(void);
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
